docs/pandas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-09-07 Wed 19:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pandas</title>
<meta name="author" content="Pradyumna Paranjape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">pandas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3b5d32f">NAME</a></li>
<li><a href="#org7aa8b50">SYNOPSIS</a></li>
<li><a href="#org90387fd">DESCRIPTION</a>
<ul>
<li><a href="#org130dd4d">Optional Arguments:</a></li>
</ul>
</li>
<li><a href="#org7e84529">ENVIRONMENT</a>
<ul>
<li><a href="#orgfe59839">PYTHONSTARTUP</a></li>
</ul>
</li>
<li><a href="#orgbbefdac">FILES</a></li>
<li><a href="#orga3007e2">SEE ALSO</a></li>
</ul>
</div>
</div>

<div id="outline-container-org3b5d32f" class="outline-2">
<h2 id="org3b5d32f">NAME</h2>
<div class="outline-text-2" id="text-org3b5d32f">
<p>
pandas - launch (i)python with pandas pre-imported
</p>
</div>
</div>

<div id="outline-container-org7aa8b50" class="outline-2">
<h2 id="org7aa8b50">SYNOPSIS</h2>
<div class="outline-text-2" id="text-org7aa8b50">
<p>
pandas -h
</p>

<p>
pandas &#x2013;help
</p>

<p>
pandas
</p>
</div>
</div>

<div id="outline-container-org90387fd" class="outline-2">
<h2 id="org90387fd">DESCRIPTION</h2>
<div class="outline-text-2" id="text-org90387fd">
<p>
Launch python interpreter (ipython if available) with pandas already imported.
</p>
</div>

<div id="outline-container-org130dd4d" class="outline-3">
<h3 id="org130dd4d">Optional Arguments:</h3>
<div class="outline-text-3" id="text-org130dd4d">
<p>
-h			Print command usage guide and exit
</p>

<p>
&#x2013;help		Print this detailed message and exit
</p>
</div>
</div>
</div>

<div id="outline-container-org7e84529" class="outline-2">
<h2 id="org7e84529">ENVIRONMENT</h2>
<div class="outline-text-2" id="text-org7e84529">
</div>
<div id="outline-container-orgfe59839" class="outline-3">
<h3 id="orgfe59839">PYTHONSTARTUP</h3>
<div class="outline-text-3" id="text-orgfe59839">
<p>
The value (file-path) of <b>PYTHONSTARTUP</b>, if set, is preserved and set to
a temporary file with additional import statements before
interpreter is launched. After the interpreter exits,
the preserved value is reset.
</p>
</div>
</div>
</div>

<div id="outline-container-orgbbefdac" class="outline-2">
<h2 id="orgbbefdac">FILES</h2>
<div class="outline-text-2" id="text-orgbbefdac">
<p>
A temporary file is used as <b>PYTHONSTARTUP</b>. If is removed after
the interpreter exits.
</p>
</div>
</div>

<div id="outline-container-orga3007e2" class="outline-2">
<h2 id="orga3007e2">SEE ALSO</h2>
<div class="outline-text-2" id="text-orga3007e2">
<ul class="org-ul">
<li>launch_py</li>
<li>numpy</li>
</ul>
</div>
</div>
</div>
</body>
</html>
